
var should = require('should');
var eu = require('../lib/index')();


describe('parse', function () {
    it('list', function (done) {
        eu.request.post('projects', {page:1}, function (err, res, body) {
            if (err) return done(err);
            var result = eu.parse.projects.page(body),
                projects = result.projects,
                viewstate = result.viewstate;

            viewstate.should.be.type('string');

            projects.length.should.equal(10);
            should.deepEqual(Object.keys(projects[0]), ['id','place','duration']);

            // can break over the time!
            should.deepEqual(projects, [
            {
                id: 13964,
                place: 'България; ЮГОЗАПАДНА И ЮЖНА ЦЕНТРАЛНА БЪЛГАРИЯ; Югозападен; София град; Столична',
                duration: 21
            },
            {
                id: 48909,
                place: 'България; ЮГОЗАПАДНА И ЮЖНА ЦЕНТРАЛНА БЪЛГАРИЯ; Югозападен; Благоевград; Петрич',
                duration: 12
            },
            {
                id: 54424,
                place: 'България; СЕВЕРНА И ЮГОИЗТОЧНА БЪЛГАРИЯ; Югоизточен; Сливен; Сливен',
                duration: 18
            },
            {
                id: 58588,
                place: 'България; ЮГОЗАПАДНА И ЮЖНА ЦЕНТРАЛНА БЪЛГАРИЯ; Югозападен; София област; Елин Пелин',
                duration: 15
            },
            {
                id: 64073,
                place: 'България; ЮГОЗАПАДНА И ЮЖНА ЦЕНТРАЛНА БЪЛГАРИЯ; Югозападен; Благоевград; Петрич',
                duration: 12
            },
            {
                id: 67013,
                place: 'България; ЮГОЗАПАДНА И ЮЖНА ЦЕНТРАЛНА БЪЛГАРИЯ; Югозападен; Благоевград; Петрич',
                duration: 12
            },
            {
                id: 85394,
                place: 'България; ЮГОЗАПАДНА И ЮЖНА ЦЕНТРАЛНА БЪЛГАРИЯ; Югозападен; Благоевград; Петрич',
                duration: 4
            },
            {
                id: 89207,
                place: 'България; СЕВЕРНА И ЮГОИЗТОЧНА БЪЛГАРИЯ; Югоизточен; Ямбол; Ямбол',
                duration: 6
            },
            {
                id: 97745,
                place: 'България; ЮГОЗАПАДНА И ЮЖНА ЦЕНТРАЛНА БЪЛГАРИЯ; Югозападен; Благоевград; Петрич',
                duration: 12
            },
            {
                id: 115305,
                place: 'България; СЕВЕРНА И ЮГОИЗТОЧНА БЪЛГАРИЯ; Югоизточен; Ямбол',
                duration: 7
            }]);

            done();
        });
    });
    it('single', function (done) {
        eu.request.get('project', {id:67740}, function (err, res, body) {
            if (err) return done(err);

            var result = eu.parse.project.page(body);

            should.deepEqual(result.project, {
                isun: 'BG161PO003-2.1.13-0112-C0001',
                number: null,
                name: 'Подобряване на конкурентоспособността на европейските пазари чрез технологична модернизация',
                beneficiary_id: 8573,
                program_id: 5,
                date_contract: '2012-04-12',
                date_begin: '2012-07-27',
                date_end: '2013-07-27',
                status: 'Приключен',
                description: 'Подобряване на конкурентоспособността на европейските пазари чрез технологична модернизация',
                activities: 'Подготовка и изпълнение на\r\nДейност 1\r\nПровеждане на тръжни процедури, избор на доставчици, сключване на договори с доставчиците\r\n  <br>Подготовка и изпълнение на\r\nДейност 2\r\nДоставка на Роботизирана заваръчна система с две работни зони, Специализирани заваръчни маси, МИГ/МАГ заваръчни апарати\r\n  <br>Подготовка и изпълнение на\r\nДейност 3\r\nДоставка на CNC преса за огъване на листов материал (абкантпреса)\r\n  <br>Подготовка и изпълнение на\r\nДейност 4\r\nДоставка на Хидравлична гилотина за разкрояване на листов материал\r\n  <br>Подготовка и изпълнение на\r\nДейност 5\r\nДоставка на Пневматичен ъглошлайф \r\n  <br>Подготовка и изпълнение на\r\nДейност 6\r\nДоставка на Винтов компресор за сгъстен въздух\r\n  <br>Подготовка и изпълнение на\r\nДейност 7\r\nДоставка и внедряване на CAD система за 3D инженерно проектиране и конструиране \r\n  <br>Подготовка и изпълнение на\r\nДейност 8\r\nВизуализация\r\n  <br>Подготовка и изпълнение на\r\nДейност 9\r\nОдит',
                budget_approved: 361116,
                budget_total: 593952,
                budget_bfp_total: 356371,
                budget_paid: 356371,
                budget_bfp_eu: 302916,
                budget_bfp_nat: 53456,
                budget_benef: 240744
            });

            should.deepEqual(result.ref, {
                beneficiary: {id: 8573, name: '"3 А Стийл" ООД'},
                program: {
                    id: 5,
                    name: 'Оперативна програма  "Развитие на конкурентоспособността на българската икономика"',
                    source: 'ЕФРР'
                },
                partners: [],
                executors: [
                    {id: 1830, name: '"Кимекс" ООД'},
                    {id: 9195, name: '"Лука Пачиоли" ЕООД'},
                    {id: 9323, name: '"Каммартон България" ЕООД'},
                    {id: 9964, name: '„Байер-БГ” ЕООД'},
                    {id: 10147, name: '"Ингмар БГ" ООД'},
                    {id: 15284, name: 'Протех Индустриал ЕООД'},
                    {id: 18727, name: 'ДиТра ООД'},
                    {id: 24456, name: '"АЛГО-Н" ООД'},
                    {id: 24457, name: 'АЛАНА ДИЗАЙН ООД'}
                ]
            });
            
            done();
        });
    });
});
